app/controllers/admin_controller.rb

  def analytics
    if params[:field].nil?
      fields = "*"
    else
      #fields = params[:field].map {|k,v| k }.join(",")
      # This seems to be a bit safer
      fields = params[:field].map {|k,v| Analytics.parse_field(k) }.join(",")
---
SELECT "analytics".* FROM "analytics"