app/controllers/sessions_controller.rb

  def create
    path = params[:url].present? ? URI.parse(params[:url]).path : home_dashboard_index_path
    begin
      # Normalize the email address, why not
      user = User.authenticate(params[:email].to_s.downcase, params[:password])
      # @url = params[:url]
      rescue Exception => e
    end

    if user
      if params[:remember_me]
        cookies.permanent[:auth_token] = user.auth_token if User.where(:user_id => user.user_id).exists?
---
SELECT  1 AS one FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'taloon_kp@yopmail.com' LIMIT 1