app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "auth_token", "created_at", "email", "first_name", "last_name", "password", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    user = User.new(user_params)
    user.build_benefits_data
    if user.save

UPDATE "users" SET "password" = '05a671c66aefea124cc08b76ea6d30bb', "updated_at" = '2015-03-19 19:59:22.983966' WHERE "users"."id" = 6
SELECT "users".* FROM "users" WHERE "users"."user_id" = 6 LIMIT 1
---
  def update
    message = false
    #Safest
    user = current_user

    # Still an Insecure DoR vulnerability
    # user = User.find(:first, :conditions => ["user_id = ?", "#{params[:user][:user_id]}"])

    # user = User.find(:first, :conditions => "user_id = '#{params[:user][:user_id]}'")
    # user = User.where("user_id = '#{params[:user][:user_id]}'").first
    if user
      user.skip_user_id_assign = true
      user.skip_hash_password = true
      user.update_attributes(user_params_without_password)
      if !(params[:user][:password].empty?) && (params[:user][:password] == params[:user][:password_confirmation])